def sale_id(sale_c1_id):
    if (sale_c1_id == '1'):
        sale_c2_id = {'9': '叶菜类', '10': '茄果类', '11': '根茎类', '12': '豆类', '13': '葱姜蒜', '14': '根茎类', '16': '特菜'}
    elif (sale_c1_id == '2'):
        sale_c2_id = {'218': '苹果', '219': '梨', '220': '柑橘橙柚', '221': '香蕉', '222': '葡提', '224': '瓜', '226': '桃李',
                      '227': '菠萝'}
    elif (sale_c1_id == '3'):
        sale_c2_id = {'401': '品牌鲜猪肉', '410': '品牌牛羊肉', '17': '猪分割肉', '171': '猪五花肉', '25': '猪排骨类', '30': '猪副产品',
                      '204': '肉馅/丝/片', '205': '整鸡', '206': '分割鸡产品', '207': '鸡副产品', '186': '鸡腿', '185': '鸡胸',
                      '22': '鸭肉类',
                      '413': '鲜牛肉类', '416': '冻牛肉类', '20': '羊肉类', '212': '调理类', '213': '熟食类', '214': '腌制类', '260': '半成品'}
    elif (sale_c1_id == '338'):
        sale_c2_id = {'341': '熟食类', '344': '香肠火腿', '347': '禽料类包', '350': '肉类料包', '356': '其它料包', '371': '鲜面制品',
                      '362': '包子馒头',
                      '365': '粉面水饺', '368': '油条饼类', '374': '米糕制品', '377': '其它面点', '383': '其它', '359': '酒店菜',
                      '380': '汤粥类'}
    elif (sale_c1_id == '302'):
        sale_c2_id = {'311': '鱼糜火锅类', '314': '肉糜火锅类', '317': '火锅辅料', '332': '西快小吃', '326': '速冻蔬菜', '323': '西式料理',
                      '320': '烘焙原料',
                      '329': '调味酱汁', '377': '其它面点', '335': '其它'}
    elif (sale_c1_id == '4'):
        sale_c2_id = {'47': '鲜活/冰鲜', '386': '虾/虾制品', '208': '冷冻鱼/蛙类', '168': '海带/海蜇', '168': '海带/海蜇', '389': '贝壳蟹类',
                      '392': '水产干货',
                      '166': '鱿鱼/海参', '395': '韩餐日料', '398': '应季热销', '165': '虾蟹蛙贝', '377': '其它面点', '71': '其它冻货'}
    elif (sale_c1_id == '137'):
        sale_c2_id = {'23': '鲜蛋', '170': '加工蛋', '199': '豆制品', '200': '新鲜面条', '201': '鲜制面点', '348': '烘焙面包'}
    elif (sale_c1_id == '6'):
        sale_c2_id = {'33': '食用油', '32': '大米', '34': '面粉', '35': '杂粮', '37': '烘焙佐料'}
    elif (sale_c1_id == '7'):
        sale_c2_id = {'187': '碳酸饮料', '188': '茶饮料', '189': '果汁', '55': '牛奶乳品', '54': '饮用水', '190': '功能饮料', '44': '啤酒',
                      '50': '白酒',
                      '196': '冲调饮品', '162': '休闲食品'}
    elif (sale_c1_id == '5'):
        sale_c2_id = {'242': '美菜自有品牌', '42': '调味品', '195': '调味酱', '194': '调味汁', '46': '酱油醋', '40': '干货', '45': '粉丝粉条',
                      '43': '腌菜罐头', '44': '西餐专区'}
    elif (sale_c1_id == '8'):
        sale_c2_id = {'192': '一次性用品', '59': '纸品湿巾', '58': '清洁消毒', '60': '厨房用具', '698': '纸品湿巾', '702': '园形餐盒',
                      '706': '方形餐盒', '710': '多格餐盒',
                      '714': '纸碗餐盒', '718': '酱料杯', '722': '筷子餐具包', '730': '刀叉勺', '734': '杯子吸管', '738': '塑料袋',
                      '742': '锡纸保鲜膜', '746': '清洁工具',
                      '758': '家电五金', '762': '文体办公', '766': '软百服饰'}
    elif (sale_c1_id == '140'):
        sale_c2_id = {'175': '肉类料包', '178': '预制菜'}

    return sale_c2_id
